pmo-dataset/variations/graphviz_with_ids/07.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Select route"];
  "Task_2" [label="Send ticket via\nemail"];
  "Task_3" [label="Post-travel feedback\nor services"];
  "Task_4" [label="Customer completes\njourney"];
  "Task_5" [label="Provide payment\ndetails"];
  "Task_6" [label="Send reminder"];
  "Task_7" [label="Select date and time"];
  "Task_8" [label="Provide personal\ninformation"];
  "Task_9" [label="Generate ticket"];
  "Task_10" [label="Update seat\ninventory"];
  "Task_11" [label="Send instructions"];
  "Task_12" [label="Customer searches\nfor ticket"];
  "Task_13" [label="Send ticket via SMS"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="X"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];

  "Task_2" -> "ExclusiveGateway_8";
  "Task_8" -> "ParallelGateway_3";
  "Task_4" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Task_7";
  "ExclusiveGateway_6" -> "ExclusiveGateway_9";
  "ExclusiveGateway_12" -> "ParallelGateway_4";
  "ExclusiveGateway_8" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "ExclusiveGateway_3" -> "EndNoneEvent_1";
  "ParallelGateway_1" -> "ExclusiveGateway_11";
  "ExclusiveGateway_11" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "ExclusiveGateway_3";
  "ExclusiveGateway_10" -> "ExclusiveGateway_12";
  "Task_7" -> "ParallelGateway_5";
  "Task_10" -> "ParallelGateway_1";
  "Task_11" -> "ExclusiveGateway_6";
  "Task_6" -> "ExclusiveGateway_10";
  "ExclusiveGateway_9" -> "Task_11";
  "ExclusiveGateway_2" -> "ParallelGateway_4";
  "ParallelGateway_2" -> "Task_1";
  "ParallelGateway_6" -> "Task_10";
  "ParallelGateway_4" -> "Task_4";
  "ExclusiveGateway_11" -> "ExclusiveGateway_12";
  "ExclusiveGateway_4" -> "Task_6";
  "ParallelGateway_3" -> "Task_9";
  "ExclusiveGateway_7" -> "Task_13";
  "ParallelGateway_6" -> "ExclusiveGateway_7";
  "ExclusiveGateway_10" -> "ExclusiveGateway_4";
  "Task_9" -> "ParallelGateway_6";
  "Task_5" -> "ParallelGateway_3";
  "ExclusiveGateway_1" -> "ExclusiveGateway_9";
  "ExclusiveGateway_5" -> "Task_3";
  "StartNoneEvent_1" -> "Task_12";
  "ParallelGateway_5" -> "Task_8";
  "Task_12" -> "ParallelGateway_2";
  "ParallelGateway_5" -> "Task_5";
  "Task_3" -> "ExclusiveGateway_3";
  "ParallelGateway_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_7" -> "Task_2";
  "ExclusiveGateway_6" -> "ExclusiveGateway_2";
  "Task_1" -> "ParallelGateway_5";
  "Task_13" -> "ExclusiveGateway_8";
}
